### 1.Importing modules that interact with the database.

In [1]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\kymani\appdata\local\programs\python\python39\lib\site-packages (2.9.6)

WARNING: You are using pip version 21.1.3; however, version 23.2.1 is available.
You should consider upgrading via the 'c:\users\kymani\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

In [9]:
import warnings

In [10]:
import psycopg2

In [11]:
warnings.filterwarnings('ignore')

In [12]:
import pandas as pd

In [13]:
conn = psycopg2.connect("dbname=myduka user=postgres password=1234")

In [14]:
conn

In [81]:
df = pd.read_sql_query("SELECT my_sales.id as sales_id, name, buying_price, selling_price, my_sales.quantity as sales_quantity, created_at as sales_created_at FROM Products,my_sales WHERE products.id = my_sales.pid", conn)

In [82]:
df

,sales_id,name,buying_price,selling_price,sales_quantity,sales_created_at
0,1,john,45.0,56.0,45.0,2023-06-22 18:37:15.684384
1,2,kim,56.0,89.0,34.0,2023-06-22 18:38:07.962995
2,3,tissue,45.0,56.0,89.0,2023-06-22 18:39:22.898928
3,4,milk,34.0,67.0,567.0,2023-06-22 18:39:49.750845
4,5,john,45.0,56.0,576.0,2023-06-22 20:22:40.404530
...,...,...,...,...,...,...
879,880,Nantucket - 518ml,183.0,256.2,439.0,2022-07-08 00:00:00.000000
880,881,Rappini - Andy Boy,254.0,355.6,435.0,2022-08-04 00:00:00.000000
881,882,tissue,45.0,56.0,369.0,2022-09-04 00:00:00.000000
882,883,Pork - Caul Fat,16.0,22.4,223.0,2022-10-15 00:00:00.000000
883,884,"Lettuce - Romaine, Heart",232.0,324.8,87.0,2022-09-03 00:00:00.000000

## 2.Set column index

In [83]:
df.set_index('sales_id')

,name,buying_price,selling_price,sales_quantity,sales_created_at
sales_id,,,,,
1,john,45.0,56.0,45.0,2023-06-22 18:37:15.684384
2,kim,56.0,89.0,34.0,2023-06-22 18:38:07.962995
3,tissue,45.0,56.0,89.0,2023-06-22 18:39:22.898928
4,milk,34.0,67.0,567.0,2023-06-22 18:39:49.750845
5,john,45.0,56.0,576.0,2023-06-22 20:22:40.404530
...,...,...,...,...,...
880,Nantucket - 518ml,183.0,256.2,439.0,2022-07-08 00:00:00.000000
881,Rappini - Andy Boy,254.0,355.6,435.0,2022-08-04 00:00:00.000000
882,tissue,45.0,56.0,369.0,2022-09-04 00:00:00.000000
883,Pork - Caul Fat,16.0,22.4,223.0,2022-10-15 00:00:00.000000
884,"Lettuce - Romaine, Heart",232.0,324.8,87.0,2022-09-03 00:00:00.000000

## 3.checking data types

In [65]:
df.dtypes

id                         int64
name                      object
buying_price             float64
selling_price            float64
stock_quantity             int64
id                         int64
pid                        int64
quantity                 float64
created_at        datetime64[ns]
dtype: object

## 4.Cleaning up columns to follow programming naming.

In [66]:
df.columns.to_list()

['id',
 'name',
 'buying_price',
 'selling_price',
 'stock_quantity',
 'id',
 'pid',
 'quantity',
 'created_at']

## 5.Removing duplicates

In [67]:
df.shape

(884, 9)

In [68]:
new_df = df.append(df)
new_df.shape

(1768, 9)

In [69]:
new_df = df.drop_duplicates(df)

In [71]:
new_df.shape

(884, 9)

## 6.Cleaning up columns.

In [72]:
df.columns.map(str.lower,na_action='ignore')

Index(['id', 'name', 'buying_price', 'selling_price', 'stock_quantity', 'id',
       'pid', 'quantity', 'created_at'],
      dtype='object')

## 7.Dealing with null values.

## 8.Summary statistics.

In [84]:
df.corr()

                sales_id  buying_price  selling_price  sales_quantity
sales_id        1.000000      0.005830       0.005312       -0.022198
buying_price    0.005830      1.000000       0.980634        0.008265
selling_price   0.005312      0.980634       1.000000        0.004526
sales_quantity -0.022198      0.008265       0.004526        1.000000

## 9.Creating new columns.

In [76]:
df['profit'] = df['selling_price'] - df['buying_price'] * df['stock_quantity']

In [77]:
df.head(15)

,id,name,buying_price,selling_price,stock_quantity,id,pid,quantity,created_at,profit
0,1,john,45.0,56.0,3457,1,1,45.0,2023-06-22 18:37:15.684384,-155509.0
1,2,kim,56.0,89.0,7899,2,2,34.0,2023-06-22 18:38:07.962995,-442255.0
2,4,tissue,45.0,56.0,87,3,4,89.0,2023-06-22 18:39:22.898928,-3859.0
3,3,milk,34.0,67.0,34456,4,3,567.0,2023-06-22 18:39:49.750845,-1171437.0
4,1,john,45.0,56.0,3457,5,1,576.0,2023-06-22 20:22:40.404530,-155509.0
5,3,milk,34.0,67.0,34456,6,3,987.0,2023-06-22 20:22:48.808066,-1171437.0
6,1,john,45.0,56.0,3457,7,1,642.0,2023-06-22 20:30:44.261793,-155509.0
7,6,wet wipes,56.0,80.0,565678,8,6,120.0,2023-06-23 17:48:12.334315,-31677888.0
8,1,john,45.0,56.0,3457,9,1,543.0,2023-06-23 17:48:31.006963,-155509.0
9,3,milk,34.0,67.0,34456,10,3,695.0,2023-06-23 17:49:44.029834,-1171437.0
10,5,maize flour,123.0,450.0,566877,11,5,234.0,2023-06-23 17:50:02.258185,-69725421.0
11,6,wet wipes,56.0,80.0,565678,12,6,908.0,2023-06-23 17:50:16.290477,-31677888.0
12,4,tissue,45.0,56.0,87,13,4,765.0,2023-06-23 17:50:29.129704,-3859.0
13,7,wheat flour,78.0,150.0,537,14,7,87.0,2023-06-29 18:33:42.691096,-41736.0
14,43,Pate - Liver,49.0,68.6,90,15,43,382.0,2022-12-07 00:00:00.000000,-4341.4